test/multiphase/reactingTwoPhaseEulerFoam/populationBalanceModeling/negativeDrift/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injector1
{
    timeStart       0;
    duration        4;
    selectionMode   all;
}

options
{
    massSource1
    {
        type            scalarSemiImplicitSource;

        $injector1;

        volumeMode      specific;
        injectionRateSuSp
        {
            thermo:rho.air     (-0.0258575 0); // kg/s/m³
            thermo:rho.water    (25.8575 0); // kg/s/m³
        }
    }
}


// ************************************************************************* //
